读书笔记/玩转情节与结构.tex
% Created 2026-05-24 日 22:41
% Intended LaTeX compiler: pdflatex
\documentclass[11pt, twoside, hidelinks]{memoir}
        \setstocksize{9.25in}{7.5in}
        \settrimmedsize{\stockheight}{\stockwidth}{*}
        \setlrmarginsandblock{1.5in}{1in}{*}
        \setulmarginsandblock{1in}{1.5in}{*}
        \checkandfixthelayout
        \setcounter{tocdepth}{0}
        \renewcommand{\baselinestretch}{1.25}
        \chapterstyle{bianchi}
        \setsecheadstyle{\normalfont \raggedright \textbf}
        \usepackage{fontspec}
        \setmainfont{LXGW WenKai}
        % \IfFontExistsTF{LXGW WenKai}{}{\setmainfont{Noto Serif CJK SC}}
        \setsansfont{Monaspace Neon}
        \usepackage{fvextra}
        \DefineVerbatimEnvironment{verbatim}{Verbatim}{
          breaklines=true,
          breakanywhere=true,
          breaksymbol={},
          breakautoindent=false
        }
        \usepackage[authoryear]{natbib}
        \bibliographystyle{apalike}

\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{ctex}
\date{\today}
\title{玩转情节与结构}
\hypersetup{
 pdfauthor={},
 pdftitle={玩转情节与结构},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\chapter{什么是情节}
\label{sec:org225a34c}
情节会自动出现。

小标题：
\begin{itemize}
\item 对情节的看法
\item 故事的力量
\item 细说情节
\item LOCK
\item 到底有多少种情节
\item 文学小说和商业小说的差别。
\item 这样不会写出很呆板的小说吗
\item 角色、背景、对话
\item 选择场景
\end{itemize}



\begin{itemize}
\item 什么是情节，为什么说情节会自动出现。
\item 故事是什么？与情节的关系
\item LOCK 的要素
\item 如何避免写出呆板的小说
\item 为什么作者说“编排情节”这件事，即使你最终决定不遵循，努力了解它的过程也不会白费？
\end{itemize}


情节就是读者想问接下来会发生什么。

书能大卖的核心就是故事。

情节和结构能帮助作者写出很好的故事。

LOCK 系统。LOCK = Lead + Objective + Confrontation + Knockout.
主角，目标，冲突，冲击结尾。
\section{Lock}
\label{Lock system}
\subsection{主角}
\label{sec:orgb2963d4}
好故事始于有趣的主角。一个在街上要饭的人不会有多有趣，但如果他穿着燕尾服，或说可以用小说换取一顿饭，那就比较有意思。

纳博科夫说堂吉诃德这本书的结构松散，只是有一个有趣的主角。
\subsection{目标}
\label{sec:org938b4b7}
角色有了目标，有了需求和渴望，小说就会有了动力。当堂吉诃德有了目标，一下子就有趣起来。

目标是小说的动力，驱动故事前进，避免主角在原地踏步。

\begin{itemize}
\item 想要得到某事物
\item 想要逃离某事物
\end{itemize}


扎实的情节中，主角只有一个主要目标，故事的核心就是，主角能达成目标吗。

目标要与他的命运息息相关，如果无法取得或逃离，他的处境就会急转直下。
\begin{itemize}
\item 保命有关，死亡威胁
\item 保护所爱
\item 证明自己，否则就会灵魂死亡，失去自我。
\item 获得谜团
\item 完成承诺
\end{itemize}
\subsection{冲突}
\label{sec:orge332859}
如果主角在追求目标的路上毫无障碍，我们就剥夺了读者偷偷渴望的一件事：担心。读者想为主角担心受怕，这样才能从头到尾深深投入小说当中。
\subsection{结尾}
\label{sec:orged9b1de}
故事要有重击的力道

\begin{quote}
只要有好结局，读者就会满意，即便其余段落可能差强人意（前提是读者愿意撑到结局）；然而烂结局会让读者失望，即便先前整本书的情节结构都非常稳固。
\end{quote}
\section{有多少情节：此书中十二种}
\label{sec:orge2308e2}
只要让引人注目的主角通过奋斗达成目标，你就每次都能写出扎实的故事。

\begin{quote}
“一旦笔下角色面临问题，而且是很严重的问题，这时‘编排情节’指的不过就是看他如何脱离困境罢了。”
\end{quote}
\section{调味料：独特的小说}
\label{sec:org0cdfc9c}
\subsection{角色}
\label{sec:org3c30a47}
\begin{quote}
活灵活现的角色仍是写出隽永好作品的秘方和神奇公式。多阅读，甚至研究自古名家的作品。你必然会发现，正是他们对人类个性的剖析，才让他们的作品历久弥新，流传至今……
\end{quote}

让我们检验是否正确。
\subsection{背景}
\label{sec:org21d216d}
故事发生的地方；主角身边的生活细节。

我们经常看到“恋人未满”的男女在餐厅里谈话？同样的情节演来演去，到头来只有服务生端给他们吃的东西不同。
为什么不把他们放在树屋里？停在隧道里的地铁上？海边的木板道下？

要多做研究，深入探讨某些职业。你可以亲自去受训，或访问该领域的专家。

不要用陈腔滥调的口吻描述角色工作。挖深一点，找出这项工作独特的细节。
\subsection{对话}
\label{sec:orga488979}
\begin{enumerate}
\item 每个人都要有自己的说话方式
\item 角色的遣词造句应该稍微透露他的为人
\end{enumerate}


语言的武器种类繁多——发怒、取绰号、耍赖、顾左右而言他——人类互动的各种模式都可以使用。
\subsection{选择场景}
\label{sec:org9fa7068}

要多列出情节的选项。第一反应通常是陈词滥调。

如，警察闯进房里，与坏人搏斗，最后坏人死了。

这是第一反应想到的，是陈词滥调，绝对不能用。
\begin{itemize}
\item 改变结果。
\begin{itemize}
\item 如果警察死了
\item 如果两者同归于尽了呢
\item 如果警察被骗了，房子里根本不是歹徒
\end{itemize}
\item 改变在场角色
\begin{itemize}
\item 如果有无辜的第三者呢
\item 如果根本没有人
\end{itemize}
\item 改变环境
\begin{itemize}
\item 如果不是普通的房间，而是精神病院的监控室、幼儿园的教室、太空站的舱体？
\item 如果枪战发生的时间不是现在，而是倒计时开始后的 60 秒内（炸弹、飞船起飞）？
\item 如果闯入的瞬间，停电了？
\end{itemize}
\end{itemize}


拿出一张纸或打开空白文档，给自己设定一个时间（比如 5-10 分钟），把你刚刚通过提问想到的所有可能性，不加评判、不论优劣地全部用短语或短句列出来。

关键原则：数量重于质量。目标是写出 20 个、30 个甚至更多的选项。在这个阶段，越疯狂、越偏离常规的想法越好。因为“合理”可以后期修改，但“平庸”无法挽救。

列完后，放松一下，去做点别的事。让你的潜意识去处理这些素材。当你再回来看这张列表时，你会发现：

有些选项虽然有趣，但过于天马行空，与你故事的基调不符。

有些选项初看很普通，但结合你之前的人物设定，能产生奇妙的化学反应。

而总有那么一两个选项，会让你心里一动，感觉“对了，就是这个！”

这个“突然想通的瞬间”，不是凭空降临的，正是你在前一步中积累了足够多的“思维碎片”后，大脑自动完成的拼图。
\chapter{什么是结构}
\label{What is plot structure}
结构是小说的骨架，用以整合故事的各个段落。结构的要点：
\begin{enumerate}
\item 元素。混合各项元素
\item 时机。每项元素应当安插在特定的位置。
\end{enumerate}
\section{三幕结构}
\label{sec:orge48fce1}
开头，中段，结尾。

开头最重要的作用是让读者对角色产生共鸣。除此之外，还有：奠定基调、介绍人物与对手、说服读者进入中段。

中段则是冲突发生的地方。还可以：深化角色关系、发展支线、为结局做铺垫

结尾要把所有线索收束干净；创造余韵
\subsection{扰乱事件}
\label{sec:org681e36e}

介绍角色之后，要安排扰乱事件，避免故事过于枯燥。冲突无需多么严重，只要打破主角平静的生活就好。
如：
\begin{quote}
萝拉一穿衣服就走到大门口，刚好看到洛杉矶警局的警车停在门前的人行道旁。
\end{quote}
这就是扰乱事件，虽然是小事情，但却确实打乱了她的日常生活。
\begin{itemize}
\item 半夜打来的电话
\item 信中提到一些奇妙的消息
\item 老板把主角叫进他的办公室
\item 小孩被送去医院
\item 车子在沙漠中的小镇抛锚
\item 主角中了彩票
\item 主角目击一场意外或谋杀案
\item 主角的太太（或先生）留下字条，告知她（他）要离开了
\end{itemize}


扰乱事件虽然打破了日常生活，主角却还没有卷入到不可逃脱的事件之中。还需要跨入第一扇门，才能让他永远回不去。

在《傲慢与偏见》中，Bingley 买下 Netherfield 庄园，班纳特太太立刻将其视为一个绝佳的机会。
一个英俊的单身富绅搬到了附近，这无疑打破了他们平静乡村生活的平衡。然而此时，班纳特一家虽然被这个消息搅得心神不宁，却并未被真正卷入事件的核心。他们还可以选择观望，可以继续保持原有的生活轨迹。这就是扰乱事件的精妙之处：它像一颗石子投入湖面，激起涟漪，却尚未形成无法挣脱的漩涡。

在《魔戒》中，比尔博·巴金斯先生在甘道夫的鼓动下，在他的生日宴会上当众消失，并留下了一枚普通的金戒指给佛罗多，自己则踏上了离开夏尔的旅程。

在 Brandon Sanderson 的 \emph{Mistborn} 之中，凯蒙突然决定带纹前往教廷财务廷总部，与上圣祭司亚瑞耶夫会面，以获取契约预付款。
这一事件打破了纹的日常生活状态（在密屋中执行常规任务、躲避凯蒙的暴力），将她带入一个充满未知风险的境地——进入教廷核心区域、面对高阶圣务官和潜在的审判者威胁。然而此时纹尚未被完全卷入不可逃脱的事件中，她仍有观察和逃跑的可能，

这些都不是进入第二幕的门，
\subsection{两扇门}
\label{sec:org85148d4}
有两扇门最重要，从第一幕到第二幕，第二幕到第三幕。

在第二幕开头，埃德蒙伪造信件，诬陷埃德加意图谋害父亲葛罗斯特伯爵。这一事件不仅打破了家族表面的平静，更将埃德加推向逃亡之路，也使埃德蒙自己彻底卷入争夺继承权的阴谋漩涡。从此，埃德加再不能以合法继承人的身份安然生活，埃德蒙也无法继续隐藏在暗处施展伎俩。他们都已跨过第一扇门，进入不可逆转的冲突之中。
\subsubsection{第一扇门}
\label{sec:org2377ad0}
主角在激励事件后主动做出的、不可撤销的抉择或行动，其功能在于标志着主角正式告别“普通世界”，并锁定了故事的核心目标与方向。
\subsubsection{第二扇门}
\label{sec:org6136eca}
想从中段进入结尾——第二扇无法折返的门——也必须发生一件事，导向最后的对峙。第二扇门通常是一条重要线索或信息，或是重大挫折和危机，借此将故事快速抛向结局。这时小说通常只剩下不到四分之一的篇幅。
\end{document}
